# Source Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ImageType..::..Source Property
ImageType Class See Also
---
The source of the image in the ImageType.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public ImageTypeSource Source { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Source As ImageTypeSource
	Get
```

Visual C++
---
```text
public:
property ImageTypeSource Source {
	ImageTypeSource get ();
}
```

# See Also
ImageType Class
Autodesk.Revit.DB Namespace